# Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [6]:
import pandas 
Following_data = [ 4, 8, 15, 16, 23,42]
data = pandas.Series(Following_data)
print(data)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

# Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
# variable print it.

In [11]:
Var = [ 3,5,6,1,4,7,8,0,9,2 ]
apply = pandas.Series(Var)
print(apply)

0    3
1    5
2    6
3    1
4    4
5    7
6    8
7    0
8    9
9    2
dtype: int64

# Q3. Create a Pandas DataFrame that contains the following data:
# Then, print the DataFrame.

In [14]:
# Answer3.
import pandas
Data_f = {
    "Name" : [ 'BOB' , 'Alice' , 'Claire' ] ,
    "Age" : [ 25 , 30 , 27 ] ,
    "Gender" : [ 'Male' , 'Female' , 'Female' ] ,
}
new_var = pandas.DataFrame(Data_f)
print(new_var)

     Name  Age  Gender
0     BOB   25    Male
1   Alice   30  Female
2  Claire   27  Female

# Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

# Answer: A Pandas DataFrame is a 2 dimensional data structure.Like a Table with row and column and it is a different datatype form Series. A collection of Series objects, where each Series represents a column of the DataFrame. 
# Here's the Example of Series and Dataframe  -

In [8]:
# Series.

import pandas
Data_for_Series = [1,35,6, 'Golu' , 'Monu' ]
Pandas_Series = pandas.Series(Data_for_Series)
print(Pandas_Series)

0       1
1      35
2       6
3    Golu
4    Monu
dtype: object

In [10]:
# DataFrame.

Data = {
    "Name" : [ 'Kamlesh','Mahesh','Nazim' ],
    "Class" : [2 , 2 , 2],
    "Time" : ['9am','10am','11am']
}  
DataFrame = pandas.DataFrame(Data)
print(DataFrame)

      Name  Class  Time
0  Kamlesh      2   9am
1   Mahesh      2  10am
2    Nazim      2  11am

# Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame?Can you give an example of when you might use one of these functions?

In [ ]:
Answer5.
Pandas provide a wide range of functions to manipulating the data in a DataFrame.
1.head() and tail() = it is used to show the first and last 5 rows.
2.shape = it is used to show the number of the rows and columns.
3.info() = it is used to show the information about the data.
4.describe() = it is used to show the summary of the data.
5.loc[] = it is used to show the rows and columns.
6.drop() = it is used to drop the rows and columns.
7.groupby() = it is used to group the data.
8.merge() = it is used to merge the data.

In [2]:
import pandas
data = {
    'Name': ['Alice', 'Bob', 'Charlie', 'David'],
    'Age': [25, 30, 22, 28],
    'City': ['New York', 'London', 'Paris', 'Tokyo']
}

df = pandas.DataFrame(data)
print(df.shape)

(4, 3)

In [3]:
df.head(1)

    Name  Age      City
0  Alice   25  New York

In [4]:
df.tail(1)

    Name  Age   City
3  David   28  Tokyo

In [5]:
df.describe()

         Age
count   4.00
mean   26.25
std     3.50
min    22.00
25%    24.25
50%    26.50
75%    28.50
max    30.00

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    4 non-null      object
 1   Age     4 non-null      int64
 2   City    4 non-null      object
dtypes: int64(1), object(2)
memory usage: 224.0+ bytes

In [7]:
df.loc[0]

Name       Alice
Age           25
City    New York
Name: 0, dtype: object

In [8]:
df.drop(0)

      Name  Age    City
1      Bob   30  London
2  Charlie   22   Paris
3    David   28   Tokyo

In [9]:
df.groupby('City')['Age'].mean()

City
London      30.0
New York    25.0
Paris       22.0
Tokyo       28.0
Name: Age, dtype: float64

In [22]:
df.merge(new_var,left_index=True,right_index=True)

    Name_x  Age_x      City  Name_y  Age_y  Gender
0    Alice     25  New York     BOB     25    Male
1      Bob     30    London   Alice     30  Female
2  Charlie     22     Paris  Claire     27  Female

# Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

In [ ]:
In Nature , the DataFrame and Series are mutable.and they can be changed but on the other Hand Panel is not mutable.

# Q7. Create a DataFrame using multiple Series. Explain with an example.

In [36]:
# Answer7.
# Creating three Series representing Students data.
import pandas as pd
Name = pd.Series(['Rahul','Pintu','Gopal','Mahesh'])
Class = pd.Series([10,10,10,10])
Subject = pd.Series(['PCM','PCM','PCM','PCM'])

# Creating a DataFrame using the three Series

std_details = pd.DataFrame({'Name':Name,'Class':Class,'Subject':Subject})
print(std_details)

     Name  Class Subject
0   Rahul     10     PCM
1   Pintu     10     PCM
2   Gopal     10     PCM
3  Mahesh     10     PCM